window.onload = genTable;
// 目錄資料陣列
function getNames() {
    return [
        ["0000", "歧路指歸", "戰德克編述", "印光大師鑑定", "李德明參定"],
        ["0001", "佛說無量壽經", "曹魏天竺三藏康僧鎧譯", "", ""],
        ["0002", "佛說無量壽經講記", "道源長老", "", ""],
        ["0003", "大乘無量壽經白話", "金剛乘三昧耶戒弟子黃念祖 敬解", "", ""],
        ["0004", "無量壽經甄解", "唐代日人道隱法師", "", ""],
        ["0005", "阿彌陀經", "姚秦龜茲三藏鳩摩羅什譯", "", ""],
        ["0006", "佛說阿彌陀經疏鈔", "明古杭雲棲寺沙門袾宏述", "", ""],
        ["0007", "佛說觀無量壽佛經", "宋西域三藏畺良耶舍譯", "", ""],
        ["0008", "稱讚淨土佛攝受經", "大唐三藏法師玄奘奉　詔譯", "", ""],
        ["0009", "金剛般若波羅蜜經", "姚秦天竺三藏鳩摩羅什譯", "", ""],
        ["0010", "大乘起信論", "馬鳴菩薩造", "梁西印度三藏法師真諦譯", ""],
        ["0011", "十二門論", "龍樹菩薩造", "姚秦三藏鳩摩羅什譯", ""],
        ["0012", "大寶積經", "大唐三藏法師菩提流志奉　詔譯", "", ""],
        ["0013", "佛說佛地經", "大唐三藏法師玄奘奉　詔譯", "", ""],
        ["0014", "佛地經論", "親光菩薩等造", "大唐三藏法師玄奘奉　詔譯", ""],
        ["0015", "佛說無量清淨平等覺經", "後漢月支國三藏支婁迦讖譯", "", ""],
        ["0016", "佛說阿彌陀三耶三佛薩樓佛檀過度人道經", "吳月支國居士支謙譯", "", ""],
        ["0017", "佛說大乘無量壽莊嚴經", "西天譯經三藏朝散大夫試光祿卿明教大師臣法賢奉　詔譯", "", ""],
        ["0018", "佛說大阿彌陀經", "南宋國學進士龍舒王日休校輯", "", ""],
        ["0", "", "", "", ""],
        ["0", "", "", "", ""]
    ]
}
// 產生目錄：分手機、電腦版，電腦版整個可以點，手機版只能點標題進入
function genTable() {
    let names = getNames();
    let text = "";
    if (window.matchMedia("(max-width: 768px)").matches) {
        // console.log("手機版");
        for (let i = 0; i < names.length; i++) {
            text += `<div class="card">`;
            text += `<p class="bookTitle"><a href="${names[i][0]}.html">${names[i][1]}</a></p>`;
            text += `<p class="name">${names[i][2]}</p>`;
            text += `<p class="name">${names[i][3]}</p>`;
            text += `<p class="name">${names[i][4]}</p>`;
            text += `</div>`;
        }
    } else {
        // console.log("電腦版");
        for (let i = 0; i < names.length; i++) {
            text += `<a href="${names[i][0]}.html" class="card">`;
            text += `<p class="bookTitle">${names[i][1]}</p>`;
            text += `<p class="name">${names[i][2]}</p>`;
            text += `<p class="name">${names[i][3]}</p>`;
            text += `<p class="name">${names[i][4]}</p>`;
            text += `</a>`;
        }
    }
    document.getElementById("show").innerHTML = text;
}
// 監聽視窗大小改變，變小就變手機版

window.addEventListener("resize", genTable);


function getVersion() {
    return [
        ["0000", "歧路指歸", "本站依當年出版品(共3種互相校對)人工抄錄", "2025-09-25", "2025-10-23"],
        ["0001", "大正新脩大藏經 第 12 冊 No. 366 佛說阿彌陀經", "2025-08", "2025-01-30", "https://cbetaonline.dila.edu.tw/zh/T0366"],
        ["0002", "大正新脩大藏經 第 12 冊 No. 365 佛說觀無量壽佛經", "2025-08", "2025-03-06", "https://cbetaonline.dila.edu.tw/zh/T0365 "],
        ["0003", "大正新脩大藏經 第 12 冊 No. 360 佛說無量壽經", "2025-08", "2025-01-30", "https://cbetaonline.dila.edu.tw/zh/T0360"],
        ["0004", "大乘無量壽經白話", "黃念老法音網站", "http://huangnianlao.net/?page_id=9148", ""],
        ["0005", "卍新纂大日本續藏經 第 22 冊 No. 424 阿彌陀經疏鈔", "2025-08", "2025-02-24", "https://cbetaonline.dila.edu.tw/zh/X0424"],
        ["0006", "無量壽經甄解", "臺中蓮社", "https://tclotus.net/tcbl/99move/read/Wujing/2/02/fd000001.htm", ""],
        ["0007", "大正新脩大藏經 第 11 冊 No. 310 大寶積經", "2025-08", "2025-07-02", "https://cbetaonline.dila.edu.tw/zh/T0310"],
        ["0008", "大正新脩大藏經 第 32 冊 No. 1666 大乘起信論", "2025-08", "2025-07-02", "https://cbetaonline.dila.edu.tw/zh/T1666"],
        ["0009", "大正新脩大藏經 第 30 冊 No. 1568 十二門論", "2025-08", "2025-01-30", "https://cbetaonline.dila.edu.tw/zh/T1568"],
        ["0010", "大正新脩大藏經 第 12 冊 No. 367 稱讚淨土佛攝受經", "2025-08", "2025-02-03", "https://cbetaonline.dila.edu.tw/zh/T12n0367"],
        ["0011", "大正新脩大藏經 第 8 冊 No. 235 金剛般若波羅蜜經", "2025-08", "2025-02-03", "https://cbetaonline.dila.edu.tw/T0235"],
        ["0012", "大正新脩大藏經 第 16 冊 No. 680 佛說佛地經", "2025-08", "2025-01-30", "https://cbetaonline.dila.edu.tw/zh/T1530"],
        ["0013", "大正新脩大藏經 第 26 冊 No. 1530 佛地經論", "2025-08", "2025-01-30","https://cbetaonline.dila.edu.tw/zh/T1530"],
        ["0014", "大正新脩大藏經 第 12 冊 No. 364 佛說大阿彌陀經", "2025-08", "2025-01-30","https://cbetaonline.dila.edu.tw/zh/T0364"],
        ["0015", "大正新脩大藏經 第 12 冊 No. 361 佛說無量清淨平等覺經", "2025-08", "2025-01-30", "https://cbetaonline.dila.edu.tw/zh/T0361"],
        ["0016", "大正新脩大藏經 第 12 冊 No. 362 佛說阿彌陀三耶三佛薩樓佛檀過度人道經", "2025-08", "2025-01-30", "https://cbetaonline.dila.edu.tw/zh/T0362"],
        ["0017", "大正新脩大藏經 第 12 冊 No. 363 佛說大乘無量壽莊嚴經", "2025-08", "2025-01-30", "https://cbetaonline.dila.edu.tw/zh/T0363"],
        ["0018", "佛說無量壽經講記", "道源長老", "", ""],
        ["0", "", "", "", ""],
        ["0", "", "", "", ""]
    ]
}